package com.test;

public class sample_09 {

	public static void main(String[] args) {
		//반복문 테스트
		//1부터 100까지의 수에 대에 합산을 출력하되, 아래 형태로 출력.
		//출력예)
		/* 10 단위 마다 개행
		 * 10 단위 마다 합산 중간 누적 결과를 출력
		 */
		int sum = 0;
		String result = "";
		for(int i = 1; i <= 100; i++) {
			result += " " + i; 
			sum += i; 
			if(i%10 == 0) {
				result += " => "+ String.valueOf(sum) + '\n'; 
			}
		}
		System.out.print(result);
	}
}
//출력결과
/*
 1 2 3 4 5 6 7 8 9 10 => 55
 11 12 13 14 15 16 17 18 19 20 => 210
 21 22 23 24 25 26 27 28 29 30 => 465
 31 32 33 34 35 36 37 38 39 40 => 820
 41 42 43 44 45 46 47 48 49 50 => 1275
 51 52 53 54 55 56 57 58 59 60 => 1830
 61 62 63 64 65 66 67 68 69 70 => 2485
 71 72 73 74 75 76 77 78 79 80 => 3240
 81 82 83 84 85 86 87 88 89 90 => 4095
 91 92 93 94 95 96 97 98 99 100 => 5050
 */